Revit 2024 API
FamilyElementVisibility.IsShownInLeftRight Property
Indicates if the instance is display in Left/Right view of project document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsShownInLeftRight { get; set; }
Visual Basic
Public Property IsShownInLeftRight As Boolean
	Get
	Set
Visual C++
public:
property bool IsShownInLeftRight {
	bool get ();
	void set (bool value);
}
Remarks
This property matters for objects whose visibility type is Model.
See Also
FamilyElementVisibility Class
Autodesk.Revit.DB Namespace